CREATE DATABASE IF NOT EXISTS DB;
USE DB;

DROP TABLE IF EXISTS ingredientsDish;
DROP TABLE IF EXISTS dishesOrdered;
DROP TABLE IF EXISTS dishes;
DROP TABLE IF EXISTS orderingFood;
DROP TABLE IF EXISTS orderingTables;
DROP TABLE IF EXISTS users;
DROP TABLE IF EXISTS passwords;
DROP TABLE IF EXISTS userTypes;
DROP TABLE IF EXISTS dishesTypes;
DROP TABLE IF EXISTS restaurantTables;
DROP TABLE IF EXISTS ingredients;

CREATE TABLE ingredients (
  id INT auto_increment PRIMARY KEY,
  ingredientName varchar(255),
  amount double
);

CREATE TABLE restaurantTables (
  id INT auto_increment PRIMARY KEY,
  numSeats INT,
  inside bool
);

CREATE TABLE dishesTypes (
  id INT auto_increment PRIMARY KEY,
  title varchar(255)
);

CREATE TABLE userTypes (
  id INT auto_increment PRIMARY KEY,
  typeUser varchar(255)
);
CREATE TABLE passwords (
  id INT auto_increment PRIMARY KEY,
  password varchar(255)
);
CREATE TABLE users (
  id INT auto_increment PRIMARY KEY,
  idUserType INT NOT NULL,
  username varchar(255),
  email varchar(255),
  phone varchar(255),
  idPassword INT,
  FOREIGN KEY (idPassword) REFERENCES passwords (id),
  FOREIGN KEY (idUserType) REFERENCES userTypes (id)
);


CREATE TABLE orderingTables (
  id INT auto_increment PRIMARY KEY,
  numTable INT NOT NULL,
  userId INT NOT NULL,
  orderDate date,
  orderTime time,
  numSeats INT,
  statusTable INT,
  FOREIGN KEY (numTable) REFERENCES restaurantTables (id),
  FOREIGN KEY (userId) REFERENCES users (id)
);

CREATE TABLE orderingFood (
  id INT auto_increment PRIMARY KEY,
  idOrderingTable INT,
  userId INT NOT NULL,
  orderDate date,
  orderTime time,
  payment double,
  statusOrder varchar(20),
  payUp bool,
  FOREIGN KEY (userId) REFERENCES users (id),
  FOREIGN KEY (idOrderingTable) REFERENCES orderingTables (id)
);

CREATE TABLE dishes (
  id INT auto_increment PRIMARY KEY,
  dishName varchar(255),
  idDishTypes INT NOT NULL,
  price INT,
  remarks varchar(255),
  vegan bool,
  gluten bool,
  imageUrl varchar(50),
  FOREIGN KEY (idDishTypes) REFERENCES dishesTypes (id)
);

CREATE TABLE dishesOrdered (
  id INT auto_increment PRIMARY KEY,
  idOrderingFood INT NOT NULL,
  idDish INT NOT NULL,
  amount INT,
  FOREIGN KEY (idOrderingFood) REFERENCES orderingFood (id),
  FOREIGN KEY (idDish) REFERENCES dishes (id)
);

CREATE TABLE ingredientsDish (
  id INT auto_increment PRIMARY KEY,
  idDish INT NOT NULL,
  idIngredient INT NOT NULL,
  amountStock double,
  FOREIGN KEY (idDish) REFERENCES dishes (id),
  FOREIGN KEY (idIngredient) REFERENCES ingredients (id)
);

INSERT INTO dishesTypes (title) VALUES
('מנות ראשונות'),
('איטלקי'),
('מנות עיקריות'),
('סלטים'),
('קינוחים'),
('משקאות חמים'),
('משקאות קרים');

INSERT INTO ingredients (ingredientName, amount) VALUES
('חסה', 2.5),
('עגבניות', 3.0),
('מלפפונים', 4.0),
('בצל', 1.5),
('גזר', 2.0),
('תפוח אדמה', 3.0),
('בטטה', 1.0),
('תירס', 2.5),
('שמנת', 1.0),
('פרוסות תות', 0.5),
('טונה במים', 1.5),
('סלט', 1.0),
('מים מינרליים', 1.5),
('קולה', 2.0),
('מיץ תפוזים', 2.5),
('שישייה', 3.0),
('קפה אספרסו', 3.5),
('תה ירוק', 2.0),
('קוקה איצית', 2.5);

INSERT INTO restaurantTables (numSeats, inside) VALUES
(4, true),
(4, false),
(6, true),
(6, true),
(6, true),
(6, true),
(6, true),
(8, false),
(7, true),
(8, false),
(3, false),
(6, false),
(4, false),
(8, false),
(4, false),
(8, false),
(2, true);


INSERT INTO userTypes (typeUser) VALUES
('מנהל'),
('מלצר'),
('לקוח'),
('שף');

INSERT INTO passwords (password) VALUES
('admin_password'),
('waiter1_password'),
('customer1_password'),
('chef_password'),
('waiter2_password'),
('waiter3_password'),
('waiter4_password'),
('waiter5_password');

INSERT INTO users (idUserType, username, email, phone, idPassword) VALUES
(1, 'admin', 'admin@example.com', '123456789', 1),
(2, 'waiter1', 'waiter1@example.com', '987654321', 2),
(2, 'waiter2', 'waiter2@example.com', '987114321', 4),
(2, 'waiter3', 'waiter3@example.com', '987624321', 5),
(2, 'waiter4', 'waiter4@example.com', '987124321', 6),
(2, 'waiter5', 'waiter5@example.com', '987664321', 7),
(3, 'customer1', 'customer1@example.com', '111222333', 3),
(4, 'chef', 'chef@example.com', '111222333', 4);


-- INSERT INTO orderingTables (numTable, userId, orderDate, orderTime, numSeats , statusTable) VALUES
-- (1, 3, '2024-07-01', '18:30:00', 4, 1),
-- (2, 3, '2024-07-02', '20:00:00', 4, 1),
-- (3, 2, '2024-07-03', '12:00:00', 6, 1),  
-- (4, 2, '2024-07-04', '15:00:00', 6, 1),
-- (5, 3, '2024-07-05', '19:00:00', 6, 1),
-- (6, 3, '2024-07-06', '13:00:00', 6, 1),
-- (7, 3, '2024-07-07', '18:00:00', 8, 1),
-- (8, 3, '2024-07-08', '14:00:00', 7, 1),
-- (9, 2, '2024-07-09', '12:30:00', 8, 1),
-- (10, 2, '2024-07-10', '19:30:00', 8, 1),
-- (11, 3, '2024-07-11', '20:00:00', 4, 1); -- שולחן שהוזמן ללא הזמנת מאכלים


-- INSERT INTO orderingFood (idOrderingTable, userId, orderDate, orderTime, payment, statusOrder, payUp) VALUES
-- (1, 3, '2024-07-01', '18:30:00', 120.50, 1, true),
-- (2, 3, '2024-07-02', '20:00:00', 85.75, 1, true),
-- (3, 2, '2024-07-03', '12:00:00', 75.00, 1, true),
-- (4, 2, '2024-07-04', '15:00:00', 60.00, 1, true),
-- (5, 3, '2024-07-05', '19:00:00', 110.00, 1, true),
-- (6, 3, '2024-07-06', '13:00:00', 90.00, 1, true),
-- (7, 3, '2024-07-07', '18:00:00', 130.00, 1, true),
-- (8, 3, '2024-07-08', '14:00:00', 105.00, 1, true),
-- (9, 2, '2024-07-09', '12:30:00', 140.00, 1, true),
-- (10, 2, '2024-07-10', '19:30:00', 95.00, 1, true),
-- (NULL, 3, '2024-07-11', '21:00:00', 45.00, 1, true); -- מאכלים שהוזמנו ללא הזמנת שולחן

INSERT INTO dishes (dishName, idDishTypes, price, remarks, vegan, gluten, imageUrl) VALUES
('ציפס זוקיני', 1, 32, 'קריספי זוקיני, לצד מטבל איולי טרטר.', true, true, 'ציפס זוקיני.png'),
('סמוסה ישראלית', 1, 35, 'כיסוני בצק במילוי תפו"א ובצל מטוגן, מונחים על חציל קלוי, טרטר עגבניות , גרגירי חומוס, טחינה ופטרוזיליה', false, true, 'סמוסה ישראלית.png'),
('טרטר חציל', 1, 43, 'חציל שרוף, בולגרית, סלסת עגבניות , טחינה, קראנץ קינואה, צנונית, בצל ירוק ופטרוזיליה מוגש עם פוקצינה', true, false, 'טרטר חציל.png'),
('ציפס 4   גבינות', 1, 48, 'ציפס ברוטב צדר, גבינות ופטרוזיליה', true, true, 'ציפס 4 גבינות.png'),
('סלט פנצנלה', 1, 47, 'מיקס עגבניות, קרעי מוצרלה, שום קונפי, בצל סגול וזיתי קלמטה, נענע, בזיליקום ופטרוזיליה, מתובל בלימון ושמן זית, בלסמי מצומצם מוגש עם פוקצינה', true, false, 'סלט פנצנלה.png'),
('ארנציני', 1, 46, 'כדורי ריזוטו פריכים עם פטריות וכמהין, מוצרלה וגבינת מנצגו, מונחים על רוטב רוזה, בלסמי מצומצם, פרמזן ובצל ירוק', true, false, 'ארנציני.png'),
('אצבעות מוצרלה', 1, 46, 'בציפוי פריך, לצד רוטב עגבניות איטלקי ופסטו', true, true, 'אצבעות מוצרלה.png'),
('פרחי כרובית', 1, 49, 'בציפוי פריך, קרם פרש, גרידת עגבניות, סלטון עלים, שקדים קלויים ופרמזן', true, true, 'פרחי כרובית.png'),
('מק אנד ציז', 2, 57, 'פסטה רדיאטורי ברוטב גבינות, מוקרם במוצרלה ופרמזן', true, true, 'מק אנד ציז.png'),
('קנלוני ארטישוק ירושלמי', 2, 76, 'קנלוני במילוי גבינות וארטישוק ירושלמי ברוטב אלפרדו פטריות וערמונים, מוקרם במוצרלה.', true, true, 'קנלוני ארטישוק ירושלמי.png'),
('פיצה בוראטה', 2, 83, 'רוטב עגבניות קלאסי, גבינת מוצרלה, שרי, קלמטה, עלי בזיליקום, בצל סגול, שום קונפי, בוראטה ורוטב בלסמי מצומצם.', true, true, 'פיצה בוראטה.png'),
('פנה פיצה', 2, 57, 'פנה ברוטב רוזה, מוקרמת במוצרלה ואורגנו *ניתן לקבל גרסה טבעונית של המנה', false, true, 'פנה פיצה.png'),
('פיצה', 2, 59, 'רוטב עגבניות קלאסי, גבינת מוצרלה ו2 תוספות לבחירה. גבינה בולגרית/עגבניות/בצל/פלפל קלוי/פטריות/זיתים ירוקים/תירס. *ניתן לקבל גרסה טבעונית של המנה.', false, true, 'פיצה.png'),
('רביולי בטטה', 2, 71, 'חמאת שום, רוטב אלפרדו, ציר ירקות, שברי פקאן סיני, ציפס בטטה, בצל ירוק ופרמזן', false, true, 'רביולי בטטה.png'),
('רביולי גבינות', 2, 73, '', false, true, 'רביולי גבינות.png'),
('לזניה', 2, 79, 'שכבות פסטה תרד במילוי גבינות, ברוטב רוזה, מוקרם במוצרלה ופרמזן', false, true, 'לזניה.png'),
('גירוס סלמון', 3, 67, 'פיתה יוונית, נתחי סלמון צלוי, טחינה, סלסת פלפלים פיקנטית, עשבים ירוקים, בצל סגול, פרוסות עגבנייה, מוגש לצד ציפס.', false, true, 'גיריס סלומון.png'),
('תבשיל סמוסה טבעונית', 3, 61, ' כיסוני בצק במילוי תפו"א ובצל מטוגן, ברוקולי, שעועית ואפונה, כרישה, שום, עלים ירוקים ותרד, ברוטב קארי ירוק. מוגש עם אורז', false, true, 'תבשיל סמוסה טבעונית.png'),
('תבשיל סלמון בקארי', 3, 79, 'קוביות סלמון, מוקפצות ברוטב קארי ירוק, בצל סגול, פטריות, ברוקולי,   אפונה, שעועית ירוקה, זוקיני וכוסברה, מוגש לצד אורז וסלט אישי', false, true, 'תבשיל סלומון בקארי.png'),
('מוקפץ ירקות', 3, 63, 'אטריות נודלס, מוקפצות עם בצל, פלפל, זוקיני, כרוב, פטריות, שעועית ירוקה, גזר, אפונה, ברוקולי ובצל ירוק, ברוטב טריאקי ובוטנים גרוסים תוספת סלמון 22₪ *ניתן לקבל גרסה טבעונית של המנה', false, true, 'מוקפץ ירקות.png'),
('שניצל פיש & פוטטוס', 3, 67, 'צונגו דג בציפוי פריך, מוגש על פוטטוס, איולי עשבי תיבול ואלף האיים, מוגש לצד סלט אישין', false, true, 'שניצל פיש & פוטטוס.png'),
('פאד תאי סלמון', 3, 78, 'אטריות אורז רחבות וקוביות סלמון מוקפצות עם בצל, פלפל, זוקיני, כרוב, פטריות, גזר, ברוקולי, שעועית ירוקה, אפונה ובצל ירוק, ברוטב פאד תאי פיקנטי, מוגש עם רבע לימון שומשום ובוטנים', false, true, 'פאד תאי סלומון.png'),
('פילה דג ים', 3, 95, 'דג ים צרוב עם עשבי תיבול מונח על אורז, לצד סלט אישי', false, true, 'פילה דג ים.png'),
('סלמון עשבי תיבול', 3, 97, 'צונגו דג בציפוי פריך, מוגש על פוטטוס, איולי עשבי תיבול ואלף האיים, מוגש לצד סלט אישין', false, true, 'סלומון עשבי תיבול.png'),
('סלט קינואה עדשים', 4, 68, 'מיקס קינואה ועדשים שחורות, כרוב לבן, כרוב סגול וגזר, נענע, פטרוזיליה ובזיליקום, מתובלים בשמן זית ולימון, על בסיס לאבנה, מיקס נשנושים, חמוציות וגבינת צפתית בתיבול דבש', false, true, 'סלט קינואה עדשים.png'),
('סלט קפרזה בוראטה', 4, 72, 'גבינת בוראטה, עגבניות שרי צבעוניות, פלחי עגבניה,זיתי קלמטה, בצל סגול, שום קונפי, בזיליקום, שמן זית ובלסמי מצומצם, שקד פרוס , לצד פוקצינה', false, true, 'סלט קפרזה בוראטה.png'),
('סלט בטטה', 4, 67, 'קוביות בטטה אפויות, גבינה בולגרית מגורדת וציפס בטטה, על מצע חסות, כרוב, עגבניות שרי, גזר ומלפפון  מתובל בויניגרט ותערובת גרעינים קלויים *ניתן לקבל גרסה טבעונית של המנה', false, true, 'סלט בטטה.png'),
('סלט סביח מחוזק', 4, 69, 'ביצה קשה, מסבחה של גרגירי חומוס חמים, חציל וקוביות תפוחי אדמה מוקפצים בפטרוזיליה ושום מונחים על מלפפון עגבנייה בצל ופטרוזיליה קצוצים מתובלים בשמן זית ולימון מחוזק עם כדורי פלאפל וטחינה מעל. *ניתן לקבל גרסה טבעונית של המנה.', false, true, 'סלט סביח מחוזק.png'),
('סלט טוסט', 4, 79, 'קוביות טוסט עם גבינה צהובה מוקפצות בחמאת שום על מצע חסות, כרוב, עגבניות שרי, גזר ומלפפון, מתובל בוויניגרט, שומשום ובולגרית מגורדת (מוגש ללא תוספת לחם) *ניתן לקבל גרסה טבעונית של המנה', false, true, 'סלט טוסט.png'),
('סלט בורגול ועדשים', 4, 79, 'בורגול, עדשים שחורות, קוביות בטטה אפויות, תערובת נשנושים, חמוציות, מלפפון, עגבנייה, בצל , פלפל ופטרוזיליה, מתובל בסילאן, שמן זית, לימון ובולגרית מגורדת *ניתן לקבל גרסה טבעונית של המנה', false, true, 'סלט בורגול ועדשים.png'),
('סלט חלומי ופטריות', 4, 74, 'קוביות גבינת חלומי, אגוזי מלך ופטריות מוקפצים בטריאקי, שום ופטרוזיליה, על מצע חסות, כרוב, עגבניות שרי, גזר ומלפפון. מתובל בוויניגרט ותערובת גרעינים קלויים', false, true, 'סלט חלומי ופטריות.png'),
('מלפיי', 5, 42, 'שכבות של בצק עלים , קרם וניל, אבקת סוכר ורוטב ריבת חלב', true, true, 'מלפיי.png'),
('פאי תפוחים', 5, 42, 'פאי תפוחים וקינמון', true, true, 'פאי תפוחים.png'),
('פאדג שוקולד', 5, 42, 'ליבה רכה ועשירה, מוגש עם גלידה וקצפת', true, true, 'פאדג שוקולד.png'),
('סניקרס', 5, 43, 'שוקולד מוס בציפוי שוקולד, קרם טופי, ביסקוויט שוקולד, בוטנים מלוחים וקצפת', true, true, 'סניקרס.png'),
('קוקי-גלידהי', 5, 45, '2 עוגיות שוקולד ציפס נימוחות, גלידת שמנת, רוטב שוקולד לוז ורוטב שוקולד לבן ושערות חלווה', true, true, 'קוקי-גלידה.png'),
('ריבת חלב', 5, 48, 'עוגת ריבת חלב מוגשת עם קצפת', true, true, 'ריבת חלב.png'),
('וופל בלגי', 5, 49, 'רטבים לבחירה: שוקולד אגוזים, ממרח קינדר, ריבת חלב, שוקולד לבן, מייפל. מוגש עם כדור גלידה וקצפת.', true, true, 'וופל בלגי.png'),
('קפה שחור', 6, 10, '', true, true, 'קפה שחור.png'),
('מקיאטו', 6, 11, '', true, true, 'מקיאטו.png'),
('שוקו חם', 6, 15,'', true, true, 'שוקו חם.png'),
('תה', 6, 35, '', true, true, 'תה.png'),
('משקה בריאות', 6, 23, 'ג׳ינג׳ר, דבש, לימון, נענע, תפוח ומקל קינמון', true, true, 'משקה בריאות.png'),
('קינדר לוז', 6, 35, 'חלב חם, קרם לוז, סירופ אגוז לוז, קצפת ואגוז לוז מסוכרן', true, true, 'קינדר לוז.png'),
('סחלב בטעמים', 6, 26, 'מגוון טעמים לבחירה: סחלב הפתעות, סחלב לוטוס, סחלב אגוז לוז, סחלב פיסטוק, סחלב רגיל', true, true, 'סחלב בטעמים.png'),
('משקה פיסטוק', 6, 32, 'קרם פיסטוק, חלב חם, קצפת ושוקולד לוז קצפת ופירורי פיסטוק', true, true, 'משקה פיסטוק.png'),
('תות שוקולד לבן', 7, 35, 'מסקרפונה, אייס וניל, תותים, שוקולד לבן וקצפת.', true, true, 'תות שוקולד לבן.png'),
('אפוגטו', 7, 15, 'מסקרפונה, גלידה ואספרסו', true, true, 'אפוגטו.png'),
('קפה וניל', 7, 23, '', true, true, 'אייס וניל.png'),
('שייק אלפחורס', 7, 35, 'מסקרפונה, אייס וניל, אלפחורס, ריבת חלב, קצפת וקוקוס קלוי.', true, true, 'שייק אלפחורס.png'),
('תה קר בטעמים', 7, 14, 'גינגר אפרסק, לואיזה לימונית, פירות יער, ירוק סנצה ,פרחי קמומיל, חמדת השקד', true, true, 'תה קר בטעמים.png'),
('קוקיז שייק', 7, 35, 'מסקרפונה, אייס וניל, עוגיות אוראו, שוקולד לבן, קצפת ושברי עוגיות.', true, true, 'קוקיז שייק.png'),
('קוקטייל גן עדן', 7, 35, '', true, true, 'קוקטייל גן עדן.png'),
('גרניטה פקאן', 7, 35, 'קפה קפוא בתוספת פקאן סיני גרוס', true, true, 'גרניטה פקאן.png');

-- INSERT INTO dishesOrdered (idOrderingFood, idDish, amount) VALUES
-- (1, 1, 3),
-- (1, 2, 1),
-- (1, 3, 1),
-- (1, 4, 1),
-- (1, 5, 1),
-- (2, 6, 4),
-- (2, 7, 2),
-- (2, 8, 2),
-- (3, 9, 3),
-- (3, 10, 1),
-- (3, 11, 1),
-- (4, 12, 3),
-- (4, 13, 2),
-- (4, 14, 1),
-- (5, 15, 2),
-- (5, 16, 1),
-- (5, 17, 3),
-- (6, 18, 1),
-- (6, 19, 2),
-- (6, 20, 1),
-- (7, 21, 3),
-- (7, 22, 1),
-- (7, 23, 1),
-- (8, 24, 2),
-- (8, 25, 1),
-- (8, 26, 2),
-- (9, 27, 1),
-- (9, 28, 2),
-- (9, 29, 1),
-- (10, 30, 3),
-- (10, 31, 1),
-- (10, 32, 1),
-- (11, 33, 2), -- הזמנת מאכלים ללא שולחן
-- (11, 34, 1), -- הזמנת מאכלים ללא שולחן
-- (11, 35, 3); -- הזמנת מאכלים ללא שולחן


INSERT INTO ingredientsDish (idDish, idIngredient, amountStock) VALUES
(1, 1, 0.5),
(1, 2, 1.0),
(1, 3, 0.75),
(1, 11, 0.3),
(1, 12, 0.2),
(2, 2, 1.2),
(2, 4, 0.8),
(2, 13, 0.4),
(2, 14, 0.3),
(3, 3, 1.5),
(3, 15, 0.5),
(4, 1, 0.2),
(4, 7, 0.1),
(4, 8, 0.2),
(4, 9, 0.1),
(5, 1, 0.3),
(5, 2, 1.0),
(5, 3, 0.5),
(5, 4, 0.4),
(5, 5, 0.2),
(5, 11, 0.1),
(6, 2, 1.2),
(6, 6, 0.8),
(6, 11, 0.4),
(6, 12, 0.3),
(7, 3, 1.5),
(7, 15, 0.5),
(8, 10, 0.3),
(8, 14, 0.2),
(9, 11, 0.3),
(9, 15, 0.5),
(10, 1, 0.4),
(10, 16, 0.2);
